# Помошник сборки
# Здесь можно создать последовательность вызова тех или иных команд для запуска, сборки и прочего
# Например после установки make утилиты достаточно в корне репозитория, в терминале набрать make build и програма скомпилируется 

# переменные используемсые в скриптах
MAIN_FILE = ./cmd/main.go
OUT_FILE_D = ./bin/app-d

# сюда пишем названия всех таргетов
.PHONY: run build 


# запуск программы
run: 
	go run ${MAIN_FILE}


# сборка программы
build:
	go build -o ${OUT_FILE_D} ${MAIN_FILE}